/**
 * Description:
 *  任何一个正整数都可以用 2 的幂次方表示。例如 137=2<7>+2<3>+2<0>。
 *  同时约定次方用括号来表示，即 a<b> 可表示为 a(b)。
 *  由此可知，137 可表示为 2(7)+2(3)+2(0)
 *  进一步：7=2<2>+2+2<0> ( 2<1> 用 2 表示)，并且 3=2+2<0>。
 *  所以最后 137 可表示为 2(2(2)+2+2(0))+2(2+2(0))+2(0)。
 *  又如 
 *  1315=2<10>+2<8>+2<5>+2+1
 *  所以 1315 最后可表示为 2(2(2+2(0))+2)+2(2(2+2(0)))+2(2(2)+2(0))+2+2(0)。
 *
 * Input:
 *  一行一个正整数 n
 *
 * Output:
 *  符合约定的 n 的 0,2 表示（在表示中不能有空格）。
 *
 * Hints:
 *  1≤n≤2×10<4>
 *
 */

/**
 *  Samples:
 *  1):
 *  input:
1315
 *
 *  output:
2(2(2+2(0))+2)+2(2(2+2(0)))+2(2(2)+2(0))+2+2(0)
 *
 */

#include <iostream>
using namespace std;
int n, f[20];

void dfs(int n)
{
    if (n == 0) {
        return;
    }
    int p;
    for (int i = 0; i <= 15; i++) {
        if (f[i] <= n) {
            p = i;
        }
    }
    if (p == 0) {
        cout << "2(0)";
    }
    if (p == 1) {
        cout << "2";
    }
    if (p > 1) {
        cout << "2(";
        dfs(p);
        cout << ")";
    }
    if (n != f[p]) {
        cout << "+";
        dfs(n - f[p]);
    }
}

int main()
{
    f[0] = 1;
    for (int i = 1; i <= 15; i++) {
        f[i] = f[i - 1] * 2;
    }
    cin >> n;
    dfs(n);
    return 0;
}